; ModuleID = '/mnt/d/wsl/smack/examples/linux-4.12/test_main_files/reno/b-ElVTuR.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.tcp_congestion_ops = type { i32, i32, void (%struct.sock*)*, void (%struct.sock*)*, i32 (%struct.sock*)*, void (%struct.sock*, i32, i32)*, void (%struct.sock*, i8)*, void (%struct.sock*, i32)*, void (%struct.sock*, i32)*, i32 (%struct.sock*)*, void (%struct.sock*, %struct.ack_sample*)*, i32 (%struct.sock*)*, i32 (%struct.sock*)*, void (%struct.sock*, %struct.rate_sample*)*, i64 (%struct.sock*, i32, i32*, %union.tcp_cc_info*)*, [16 x i8], %struct.module* }
%struct.sock = type { %struct.sock_common, i32, i32 }
%struct.sock_common = type { i8, %struct.possible_net_t, i64 }
%struct.possible_net_t = type { %struct.net* }
%struct.net = type { %struct.netns_ipv4 }
%struct.netns_ipv4 = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct.ack_sample = type { i32, i32, i32 }
%struct.rate_sample = type { %struct.skb_mstamp, i32, i32, i64, i64, i32, i32, i32, i8, i8 }
%struct.skb_mstamp = type { %union.anon }
%union.anon = type { i64 }
%union.tcp_cc_info = type { %struct.tcp_bbr_info }
%struct.tcp_bbr_info = type { i32, i32, i32, i32, i32 }
%struct.module = type opaque

!148 = !DIEnumerator(name: "LINUX_MIB_PFMEMALLOCDROP", value: 76, isUnsigned: true)
!149 = !DIEnumerator(name: "LINUX_MIB_TCPMINTTLDROP", value: 77, isUnsigned: true)
!150 = !DIEnumerator(name: "LINUX_MIB_TCPDEFERACCEPTDROP", value: 78, isUnsigned: true)
!151 = !DIEnumerator(name: "LINUX_MIB_IPRPFILTER", value: 79, isUnsigned: true)
!152 = !DIEnumerator(name: "LINUX_MIB_TCPTIMEWAITOVERFLOW", value: 80, isUnsigned: true)
!153 = !DIEnumerator(name: "LINUX_MIB_TCPREQQFULLDOCOOKIES", value: 81, isUnsigned: true)
!154 = !DIEnumerator(name: "LINUX_MIB_TCPREQQFULLDROP", value: 82, isUnsigned: true)
!155 = !DIEnumerator(name: "LINUX_MIB_TCPRETRANSFAIL", value: 83, isUnsigned: true)
!156 = !DIEnumerator(name: "LINUX_MIB_TCPRCVCOALESCE", value: 84, isUnsigned: true)
!157 = !DIEnumerator(name: "LINUX_MIB_TCPOFOQUEUE", value: 85, isUnsigned: true)
!158 = !DIEnumerator(name: "LINUX_MIB_TCPOFODROP", value: 86, isUnsigned: true)
!159 = !DIEnumerator(name: "LINUX_MIB_TCPOFOMERGE", value: 87, isUnsigned: true)
!160 = !DIEnumerator(name: "LINUX_MIB_TCPCHALLENGEACK", value: 88, isUnsigned: true)
!161 = !DIEnumerator(name: "LINUX_MIB_TCPSYNCHALLENGE", value: 89, isUnsigned: true)
!162 = !DIEnumerator(name: "LINUX_MIB_TCPFASTOPENACTIVE", value: 90, isUnsigned: true)
!163 = !DIEnumerator(name: "LINUX_MIB_TCPFASTOPENACTIVEFAIL", value: 91, isUnsigned: true)
!164 = !DIEnumerator(name: "LINUX_MIB_TCPFASTOPENPASSIVE", value: 92, isUnsigned: true)
!165 = !DIEnumerator(name: "LINUX_MIB_TCPFASTOPENPASSIVEFAIL", value: 93, isUnsigned: true)
!166 = !DIEnumerator(name: "LINUX_MIB_TCPFASTOPENLISTENOVERFLOW", value: 94, isUnsigned: true)
!167 = !DIEnumerator(name: "LINUX_MIB_TCPFASTOPENCOOKIEREQD", value: 95, isUnsigned: true)
!168 = !DIEnumerator(name: "LINUX_MIB_TCPFASTOPENBLACKHOLE", value: 96, isUnsigned: true)
!169 = !DIEnumerator(name: "LINUX_MIB_TCPSPURIOUS_RTX_HOSTQUEUES", value: 97, isUnsigned: true)
!170 = !DIEnumerator(name: "LINUX_MIB_BUSYPOLLRXPACKETS", value: 98, isUnsigned: true)
!171 = !DIEnumerator(name: "LINUX_MIB_TCPAUTOCORKING", value: 99, isUnsigned: true)
!172 = !DIEnumerator(name: "LINUX_MIB_TCPFROMZEROWINDOWADV", value: 100, isUnsigned: true)
!173 = !DIEnumerator(name: "LINUX_MIB_TCPTOZEROWINDOWADV", value: 101, isUnsigned: true)
!174 = !DIEnumerator(name: "LINUX_MIB_TCPWANTZEROWINDOWADV", value: 102, isUnsigned: true)
!175 = !DIEnumerator(name: "LINUX_MIB_TCPSYNRETRANS", value: 103, isUnsigned: true)
!176 = !DIEnumerator(name: "LINUX_MIB_TCPORIGDATASENT", value: 104, isUnsigned: true)
!177 = !DIEnumerator(name: "LINUX_MIB_TCPHYSTARTTRAINDETECT", value: 105, isUnsigned: true)
!178 = !DIEnumerator(name: "LINUX_MIB_TCPHYSTARTTRAINCWND", value: 106, isUnsigned: true)
!179 = !DIEnumerator(name: "LINUX_MIB_TCPHYSTARTDELAYDETECT", value: 107, isUnsigned: true)
!180 = !DIEnumerator(name: "LINUX_MIB_TCPHYSTARTDELAYCWND", value: 108, isUnsigned: true)
!181 = !DIEnumerator(name: "LINUX_MIB_TCPACKSKIPPEDSYNRECV", value: 109, isUnsigned: true)
!182 = !DIEnumerator(name: "LINUX_MIB_TCPACKSKIPPEDPAWS", value: 110, isUnsigned: true)
!183 = !DIEnumerator(name: "LINUX_MIB_TCPACKSKIPPEDSEQ", value: 111, isUnsigned: true)
!184 = !DIEnumerator(name: "LINUX_MIB_TCPACKSKIPPEDFINWAIT2", value: 112, isUnsigned: true)
!185 = !DIEnumerator(name: "LINUX_MIB_TCPACKSKIPPEDTIMEWAIT", value: 113, isUnsigned: true)
!186 = !DIEnumerator(name: "LINUX_MIB_TCPACKSKIPPEDCHALLENGE", value: 114, isUnsigned: true)
!187 = !DIEnumerator(name: "LINUX_MIB_TCPWINPROBE", value: 115, isUnsigned: true)
!188 = !DIEnumerator(name: "LINUX_MIB_TCPKEEPALIVE", value: 116, isUnsigned: true)
!189 = !DIEnumerator(name: "LINUX_MIB_TCPMTUPFAIL", value: 117, isUnsigned: true)
!190 = !DIEnumerator(name: "LINUX_MIB_TCPMTUPSUCCESS", value: 118, isUnsigned: true)
!191 = !DIEnumerator(name: "__LINUX_MIB_MAX", value: 119, isUnsigned: true)
!192 = !{!193, !194, !195, !198, !440, !649, !274}
!193 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!194 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "u64", file: !196, line: 38, baseType: !197)
!196 = !DIFile(filename: "../../stub_model/header/share.h", directory: "/mnt/d/wsl/smack/examples/linux-4.12/test_main_files/reno")
!197 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64)
!199 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "inet_connection_sock", file: !200, line: 12, size: 1600, elements: !201)
!200 = !DIFile(filename: "../../stub_model/header/simple_inet_connection_sock.h", directory: "/mnt/d/wsl/smack/examples/linux-4.12/test_main_files/reno")
!201 = !{!202, !273, !276, !277, !401, !405, !407, !408, !409, !410, !411, !412, !413, !414, !415, !427, !435, !436}
!202 = !DIDerivedType(tag: DW_TAG_member, name: "icsk_inet", scope: !199, file: !200, line: 13, baseType: !203, size: 256)
!203 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "inet_sock", file: !204, line: 11, size: 256, elements: !205)
!204 = !DIFile(filename: "../../stub_model/header/simple_inet_sock.h", directory: "/mnt/d/wsl/smack/examples/linux-4.12/test_main_files/reno")
!205 = !{!206}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "sk", scope: !203, file: !204, line: 13, baseType: !207, size: 256)
!207 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sock", file: !34, line: 51, size: 256, elements: !208)
!208 = !{!209, !271, !272}
!209 = !DIDerivedType(tag: DW_TAG_member, name: "__sk_common", scope: !207, file: !34, line: 52, baseType: !210, size: 192)
!210 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sock_common", file: !34, line: 44, size: 192, elements: !211)
!211 = !{!212, !215, !269}
!212 = !DIDerivedType(tag: DW_TAG_member, name: "skc_state", scope: !210, file: !34, line: 46, baseType: !213, size: 8)
!213 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !214)
!214 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "skc_net", scope: !210, file: !34, line: 47, baseType: !216, size: 64, offset: 64)
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "possible_net_t", file: !217, line: 22, baseType: !218)
!217 = !DIFile(filename: "../../stub_model/header/simple_net_namespace.h", directory: "/mnt/d/wsl/smack/examples/linux-4.12/test_main_files/reno")
!218 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !217, line: 18, size: 64, elements: !219)
!219 = !{!220}
!220 = !DIDerivedType(tag: DW_TAG_member, name: "net", scope: !218, file: !217, line: 20, baseType: !221, size: 64)
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 64)
!222 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "net", file: !217, line: 14, size: 1280, elements: !223)
!223 = !{!224}
!224 = !DIDerivedType(tag: DW_TAG_member, name: "ipv4", scope: !222, file: !217, line: 15, baseType: !225, size: 1280)
!225 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "netns_ipv4", file: !226, line: 12, size: 1280, elements: !227)
!226 = !DIFile(filename: "../../stub_model/header/simple_netns_ipv4.h", directory: "/mnt/d/wsl/smack/examples/linux-4.12/test_main_files/reno")
!227 = !{!228, !229, !230, !231, !232, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !251, !252, !253, !254, !255, !256, !257, !258, !259, !260, !261, !262, !263, !264, !265, !266, !267, !268}
!228 = !DIDerivedType(tag: DW_TAG_member, name: "sysctl_icmp_echo_ignore_all", scope: !225, file: !226, line: 52, baseType: !194, size: 32)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "sysctl_icmp_echo_ignore_broadcasts", scope: !225, file: !226, line: 53, baseType: !194, size: 32, offset: 32)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "sysctl_icmp_ignore_bogus_error_responses", scope: !225, file: !226, line: 54, baseType: !194, size: 32, offset: 64)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "sysctl_icmp_ratelimit", scope: !225, file: !226, line: 55, baseType: !194, size: 32, offset: 96)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "sysctl_icmp_ratemask", scope: !225, file: !226, line: 56, baseType: !194, size: 32, offset: 128)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "sysctl_icmp_errors_use_inbound_ifaddr", scope: !225, file: !226, line: 57, baseType: !194, size: 32, offset: 160)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "sysctl_tcp_ecn", scope: !225, file: !226, line: 61, baseType: !194, size: 32, offset: 192)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "sysctl_tcp_ecn_fallback", scope: !225, file: !226, line: 62, baseType: !194, size: 32, offset: 224)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "sysctl_ip_default_ttl", scope: !225, file: !226, line: 64, baseType: !194, size: 32, offset: 256)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "sysctl_ip_no_pmtu_disc", scope: !225, file: !226, line: 65, baseType: !194, size: 32, offset: 288)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "sysctl_ip_fwd_use_pmtu", scope: !225, file: !226, line: 66, baseType: !194, size: 32, offset: 320)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "sysctl_ip_nonlocal_bind", scope: !225, file: !226, line: 67, baseType: !194, size: 32, offset: 352)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "sysctl_ip_dynaddr", scope: !225, file: !226, line: 69, baseType: !194, size: 32, offset: 384)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "sysctl_ip_early_demux", scope: !225, file: !226, line: 70, baseType: !194, size: 32, offset: 416)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "sysctl_tcp_early_demux", scope: !225, file: !226, line: 71, baseType: !194, size: 32, offset: 448)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "sysctl_udp_early_demux", scope: !225, file: !226, line: 72, baseType: !194, size: 32, offset: 480)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "sysctl_fwmark_reflect", scope: !225, file: !226, line: 74, baseType: !194, size: 32, offset: 512)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "sysctl_tcp_fwmark_accept", scope: !225, file: !226, line: 75, baseType: !194, size: 32, offset: 544)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "sysctl_tcp_mtu_probing", scope: !225, file: !226, line: 79, baseType: !194, size: 32, offset: 576)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "sysctl_tcp_base_mss", scope: !225, file: !226, line: 80, baseType: !194, size: 32, offset: 608)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "sysctl_tcp_probe_threshold", scope: !225, file: !226, line: 81, baseType: !194, size: 32, offset: 640)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "sysctl_tcp_probe_interval", scope: !225, file: !226, line: 82, baseType: !250, size: 32, offset: 672)
!250 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !196, line: 31, baseType: !7)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "sysctl_tcp_keepalive_time", scope: !225, file: !226, line: 84, baseType: !194, size: 32, offset: 704)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "sysctl_tcp_keepalive_probes", scope: !225, file: !226, line: 85, baseType: !194, size: 32, offset: 736)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "sysctl_tcp_keepalive_intvl", scope: !225, file: !226, line: 86, baseType: !194, size: 32, offset: 768)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "sysctl_tcp_syn_retries", scope: !225, file: !226, line: 88, baseType: !194, size: 32, offset: 800)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "sysctl_tcp_synack_retries", scope: !225, file: !226, line: 89, baseType: !194, size: 32, offset: 832)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "sysctl_tcp_syncookies", scope: !225, file: !226, line: 90, baseType: !194, size: 32, offset: 864)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "sysctl_tcp_reordering", scope: !225, file: !226, line: 91, baseType: !194, size: 32, offset: 896)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "sysctl_tcp_retries1", scope: !225, file: !226, line: 92, baseType: !194, size: 32, offset: 928)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "sysctl_tcp_retries2", scope: !225, file: !226, line: 93, baseType: !194, size: 32, offset: 960)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "sysctl_tcp_orphan_retries", scope: !225, file: !226, line: 94, baseType: !194, size: 32, offset: 992)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "sysctl_tcp_fin_timeout", scope: !225, file: !226, line: 95, baseType: !194, size: 32, offset: 1024)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "sysctl_tcp_notsent_lowat", scope: !225, file: !226, line: 96, baseType: !7, size: 32, offset: 1056)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "sysctl_tcp_tw_reuse", scope: !225, file: !226, line: 97, baseType: !194, size: 32, offset: 1088)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "sysctl_max_syn_backlog", scope: !225, file: !226, line: 99, baseType: !194, size: 32, offset: 1120)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "sysctl_igmp_max_memberships", scope: !225, file: !226, line: 105, baseType: !194, size: 32, offset: 1152)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "sysctl_igmp_max_msf", scope: !225, file: !226, line: 106, baseType: !194, size: 32, offset: 1184)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "sysctl_igmp_llm_reports", scope: !225, file: !226, line: 107, baseType: !194, size: 32, offset: 1216)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "sysctl_igmp_qrv", scope: !225, file: !226, line: 108, baseType: !194, size: 32, offset: 1248)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "skc_flags", scope: !210, file: !34, line: 48, baseType: !270, size: 64, offset: 128)
!270 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "sk_rcvbuf", scope: !207, file: !34, line: 57, baseType: !194, size: 32, offset: 192)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "sk_sndbuf", scope: !207, file: !34, line: 58, baseType: !194, size: 32, offset: 224)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "icsk_rto", scope: !199, file: !200, line: 14, baseType: !274, size: 32, offset: 256)
!274 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !275, line: 26, baseType: !7)
!275 = !DIFile(filename: "/usr/include/asm-generic/int-ll64.h", directory: "")
!276 = !DIDerivedType(tag: DW_TAG_member, name: "icsk_pmtu_cookie", scope: !199, file: !200, line: 15, baseType: !274, size: 32, offset: 288)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "icsk_ca_ops", scope: !199, file: !200, line: 16, baseType: !278, size: 64, offset: 320)
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !279, size: 64)
!279 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !280)
!280 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tcp_congestion_ops", file: !6, line: 379, size: 1088, elements: !281)
!281 = !{!282, !283, !284, !289, !290, !294, !298, !303, !307, !311, !312, !324, !325, !326, !357, !393, !398}
!282 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !280, file: !6, line: 380, baseType: !250, size: 32)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !280, file: !6, line: 381, baseType: !250, size: 32, offset: 32)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !280, file: !6, line: 384, baseType: !285, size: 64, offset: 64)
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 64)
!286 = !DISubroutineType(types: !287)
!287 = !{null, !288}
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 64)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "release", scope: !280, file: !6, line: 386, baseType: !285, size: 64, offset: 128)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "ssthresh", scope: !280, file: !6, line: 389, baseType: !291, size: 64, offset: 192)
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 64)
!292 = !DISubroutineType(types: !293)
!293 = !{!250, !288}
!294 = !DIDerivedType(tag: DW_TAG_member, name: "cong_avoid", scope: !280, file: !6, line: 391, baseType: !295, size: 64, offset: 256)
!295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !296, size: 64)
!296 = !DISubroutineType(types: !297)
!297 = !{null, !288, !250, !250}
!298 = !DIDerivedType(tag: DW_TAG_member, name: "set_state", scope: !280, file: !6, line: 393, baseType: !299, size: 64, offset: 320)
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !300, size: 64)
!300 = !DISubroutineType(types: !301)
!301 = !{null, !288, !302}
!302 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8", file: !196, line: 29, baseType: !214)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "cwnd_event", scope: !280, file: !6, line: 395, baseType: !304, size: 64, offset: 384)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 64)
!305 = !DISubroutineType(types: !306)
!306 = !{null, !288, !5}
!307 = !DIDerivedType(tag: DW_TAG_member, name: "in_ack_event", scope: !280, file: !6, line: 397, baseType: !308, size: 64, offset: 448)
!308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !309, size: 64)
!309 = !DISubroutineType(types: !310)
!310 = !{null, !288, !250}
!311 = !DIDerivedType(tag: DW_TAG_member, name: "undo_cwnd", scope: !280, file: !6, line: 399, baseType: !291, size: 64, offset: 512)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "pkts_acked", scope: !280, file: !6, line: 401, baseType: !313, size: 64, offset: 576)
!313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 64)
!314 = !DISubroutineType(types: !315)
!315 = !{null, !288, !316}
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 64)
!317 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !318)
!318 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ack_sample", file: !6, line: 360, size: 96, elements: !319)
!319 = !{!320, !321, !323}
!320 = !DIDerivedType(tag: DW_TAG_member, name: "pkts_acked", scope: !318, file: !6, line: 361, baseType: !250, size: 32)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "rtt_us", scope: !318, file: !6, line: 362, baseType: !322, size: 32, offset: 32)
!322 = !DIDerivedType(tag: DW_TAG_typedef, name: "s32", file: !196, line: 34, baseType: !194)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "in_flight", scope: !318, file: !6, line: 363, baseType: !250, size: 32, offset: 64)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "tso_segs_goal", scope: !280, file: !6, line: 403, baseType: !291, size: 64, offset: 640)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "sndbuf_expand", scope: !280, file: !6, line: 405, baseType: !291, size: 64, offset: 704)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "cong_control", scope: !280, file: !6, line: 409, baseType: !327, size: 64, offset: 768)
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 64)
!328 = !DISubroutineType(types: !329)
!329 = !{null, !288, !330}
!330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !331, size: 64)
!331 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !332)
!332 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rate_sample", file: !6, line: 366, size: 384, elements: !333)
!333 = !{!334, !347, !348, !349, !350, !351, !352, !353, !354, !356}
!334 = !DIDerivedType(tag: DW_TAG_member, name: "prior_mstamp", scope: !332, file: !6, line: 367, baseType: !335, size: 64)
!335 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "skb_mstamp", file: !336, line: 46, size: 64, elements: !337)
!336 = !DIFile(filename: "../../stub_model/header/simple_skbuff.h", directory: "/mnt/d/wsl/smack/examples/linux-4.12/test_main_files/reno")
!337 = !{!338}
!338 = !DIDerivedType(tag: DW_TAG_member, scope: !335, file: !336, line: 47, baseType: !339, size: 64)
!339 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !335, file: !336, line: 47, size: 64, elements: !340)
!340 = !{!341, !342}
!341 = !DIDerivedType(tag: DW_TAG_member, name: "v64", scope: !339, file: !336, line: 48, baseType: !195, size: 64)
!342 = !DIDerivedType(tag: DW_TAG_member, scope: !339, file: !336, line: 49, baseType: !343, size: 64)
!343 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !339, file: !336, line: 49, size: 64, elements: !344)
!344 = !{!345, !346}
!345 = !DIDerivedType(tag: DW_TAG_member, name: "stamp_us", scope: !343, file: !336, line: 50, baseType: !250, size: 32)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "stamp_jiffies", scope: !343, file: !336, line: 51, baseType: !250, size: 32, offset: 32)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "prior_delivered", scope: !332, file: !6, line: 368, baseType: !250, size: 32, offset: 64)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "delivered", scope: !332, file: !6, line: 369, baseType: !322, size: 32, offset: 96)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "interval_us", scope: !332, file: !6, line: 370, baseType: !193, size: 64, offset: 128)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "rtt_us", scope: !332, file: !6, line: 371, baseType: !193, size: 64, offset: 192)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "losses", scope: !332, file: !6, line: 372, baseType: !194, size: 32, offset: 256)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "acked_sacked", scope: !332, file: !6, line: 373, baseType: !250, size: 32, offset: 288)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "prior_in_flight", scope: !332, file: !6, line: 374, baseType: !250, size: 32, offset: 320)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "is_app_limited", scope: !332, file: !6, line: 375, baseType: !355, size: 8, offset: 352)
!355 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "is_retrans", scope: !332, file: !6, line: 376, baseType: !355, size: 8, offset: 360)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "get_info", scope: !280, file: !6, line: 411, baseType: !358, size: 64, offset: 832)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64)
!359 = !DISubroutineType(types: !360)
!360 = !{!361, !288, !250, !363, !364}
!361 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !362, line: 62, baseType: !270)
!362 = !DIFile(filename: "/usr/lib/llvm-8/lib/clang/8.0.1/include/stddef.h", directory: "")
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 64)
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !365, size: 64)
!365 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tcp_cc_info", file: !366, line: 62, size: 160, elements: !367)
!366 = !DIFile(filename: "../../stub_model/header/simple_inet_diag.h", directory: "/mnt/d/wsl/smack/examples/linux-4.12/test_main_files/reno")
!367 = !{!368, !375, !385}
!368 = !DIDerivedType(tag: DW_TAG_member, name: "vegas", scope: !365, file: !366, line: 63, baseType: !369, size: 128)
!369 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tcpvegas_info", file: !366, line: 34, size: 128, elements: !370)
!370 = !{!371, !372, !373, !374}
!371 = !DIDerivedType(tag: DW_TAG_member, name: "tcpv_enabled", scope: !369, file: !366, line: 35, baseType: !274, size: 32)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "tcpv_rttcnt", scope: !369, file: !366, line: 36, baseType: !274, size: 32, offset: 32)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "tcpv_rtt", scope: !369, file: !366, line: 37, baseType: !274, size: 32, offset: 64)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "tcpv_minrtt", scope: !369, file: !366, line: 38, baseType: !274, size: 32, offset: 96)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "dctcp", scope: !365, file: !366, line: 64, baseType: !376, size: 128)
!376 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tcp_dctcp_info", file: !366, line: 43, size: 128, elements: !377)
!377 = !{!378, !381, !382, !383, !384}
!378 = !DIDerivedType(tag: DW_TAG_member, name: "dctcp_enabled", scope: !376, file: !366, line: 44, baseType: !379, size: 16)
!379 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !275, line: 23, baseType: !380)
!380 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "dctcp_ce_state", scope: !376, file: !366, line: 45, baseType: !379, size: 16, offset: 16)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "dctcp_alpha", scope: !376, file: !366, line: 46, baseType: !274, size: 32, offset: 32)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "dctcp_ab_ecn", scope: !376, file: !366, line: 47, baseType: !274, size: 32, offset: 64)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "dctcp_ab_tot", scope: !376, file: !366, line: 48, baseType: !274, size: 32, offset: 96)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "bbr", scope: !365, file: !366, line: 65, baseType: !386, size: 160)
!386 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tcp_bbr_info", file: !366, line: 53, size: 160, elements: !387)
!387 = !{!388, !389, !390, !391, !392}
!388 = !DIDerivedType(tag: DW_TAG_member, name: "bbr_bw_lo", scope: !386, file: !366, line: 55, baseType: !274, size: 32)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "bbr_bw_hi", scope: !386, file: !366, line: 56, baseType: !274, size: 32, offset: 32)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "bbr_min_rtt", scope: !386, file: !366, line: 57, baseType: !274, size: 32, offset: 64)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "bbr_pacing_gain", scope: !386, file: !366, line: 58, baseType: !274, size: 32, offset: 96)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "bbr_cwnd_gain", scope: !386, file: !366, line: 59, baseType: !274, size: 32, offset: 128)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !280, file: !6, line: 414, baseType: !394, size: 128, offset: 896)
!394 = !DICompositeType(tag: DW_TAG_array_type, baseType: !395, size: 128, elements: !396)
!395 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!396 = !{!397}
!397 = !DISubrange(count: 16)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !280, file: !6, line: 415, baseType: !399, size: 64, offset: 1024)
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 64)
!400 = !DICompositeType(tag: DW_TAG_structure_type, name: "module", file: !6, line: 415, flags: DIFlagFwdDecl)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "icsk_sync_mss", scope: !199, file: !200, line: 17, baseType: !402, size: 64, offset: 384)
!402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !403, size: 64)
!403 = !DISubroutineType(types: !404)
!404 = !{!7, !288, !250}
!405 = !DIDerivedType(tag: DW_TAG_member, name: "icsk_ca_state", scope: !199, file: !200, line: 18, baseType: !406, size: 6, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!406 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !275, line: 20, baseType: !214)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "icsk_ca_setsockopt", scope: !199, file: !200, line: 19, baseType: !406, size: 1, offset: 454, flags: DIFlagBitField, extraData: i64 448)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "icsk_ca_dst_locked", scope: !199, file: !200, line: 20, baseType: !406, size: 1, offset: 455, flags: DIFlagBitField, extraData: i64 448)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "icsk_retransmits", scope: !199, file: !200, line: 21, baseType: !406, size: 8, offset: 456)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "icsk_pending", scope: !199, file: !200, line: 22, baseType: !406, size: 8, offset: 464)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "icsk_backoff", scope: !199, file: !200, line: 23, baseType: !406, size: 8, offset: 472)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "icsk_syn_retries", scope: !199, file: !200, line: 24, baseType: !406, size: 8, offset: 480)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "icsk_probes_out", scope: !199, file: !200, line: 25, baseType: !406, size: 8, offset: 488)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "icsk_ext_hdr_len", scope: !199, file: !200, line: 26, baseType: !379, size: 16, offset: 496)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "icsk_ack", scope: !199, file: !200, line: 37, baseType: !416, size: 192, offset: 512)
!416 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !199, file: !200, line: 27, size: 192, elements: !417)
!417 = !{!418, !419, !420, !421, !422, !423, !424, !425, !426}
!418 = !DIDerivedType(tag: DW_TAG_member, name: "pending", scope: !416, file: !200, line: 28, baseType: !406, size: 8)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "quick", scope: !416, file: !200, line: 29, baseType: !406, size: 8, offset: 8)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "pingpong", scope: !416, file: !200, line: 30, baseType: !406, size: 8, offset: 16)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "blocked", scope: !416, file: !200, line: 31, baseType: !406, size: 8, offset: 24)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "ato", scope: !416, file: !200, line: 32, baseType: !274, size: 32, offset: 32)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !416, file: !200, line: 33, baseType: !270, size: 64, offset: 64)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "lrcvtime", scope: !416, file: !200, line: 34, baseType: !274, size: 32, offset: 128)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "last_seg_size", scope: !416, file: !200, line: 35, baseType: !379, size: 16, offset: 160)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "rcv_mss", scope: !416, file: !200, line: 36, baseType: !379, size: 16, offset: 176)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "icsk_mtup", scope: !199, file: !200, line: 49, baseType: !428, size: 160, offset: 704)
!428 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !199, file: !200, line: 38, size: 160, elements: !429)
!429 = !{!430, !431, !432, !433, !434}
!430 = !DIDerivedType(tag: DW_TAG_member, name: "enabled", scope: !428, file: !200, line: 39, baseType: !194, size: 32)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "search_high", scope: !428, file: !200, line: 42, baseType: !194, size: 32, offset: 32)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "search_low", scope: !428, file: !200, line: 43, baseType: !194, size: 32, offset: 64)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "probe_size", scope: !428, file: !200, line: 46, baseType: !194, size: 32, offset: 96)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "probe_timestamp", scope: !428, file: !200, line: 48, baseType: !250, size: 32, offset: 128)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "icsk_user_timeout", scope: !199, file: !200, line: 50, baseType: !250, size: 32, offset: 864)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "icsk_ca_priv", scope: !199, file: !200, line: 52, baseType: !437, size: 704, offset: 896)
!437 = !DICompositeType(tag: DW_TAG_array_type, baseType: !195, size: 704, elements: !438)
!438 = !{!439}
!439 = !DISubrange(count: 11)
!440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !441, size: 64)
!441 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tcp_sock", file: !442, line: 39, size: 6272, elements: !443)
!442 = !DIFile(filename: "../../stub_model/header/simple_tcp_sock.h", directory: "/mnt/d/wsl/smack/examples/linux-4.12/test_main_files/reno")
!443 = !{!444, !445, !447, !448, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !481, !482, !483, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !585, !586, !597, !598, !606, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !629, !635, !640, !641, !644, !647}
!444 = !DIDerivedType(tag: DW_TAG_member, name: "inet_conn", scope: !441, file: !442, line: 41, baseType: !199, size: 1600)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_header_len", scope: !441, file: !442, line: 42, baseType: !446, size: 16, offset: 1600)
!446 = !DIDerivedType(tag: DW_TAG_typedef, name: "u16", file: !196, line: 30, baseType: !380)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "gso_segs", scope: !441, file: !442, line: 43, baseType: !446, size: 16, offset: 1616)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "pred_flags", scope: !441, file: !442, line: 49, baseType: !449, size: 32, offset: 1632)
!449 = !DIDerivedType(tag: DW_TAG_typedef, name: "__be32", file: !450, line: 30, baseType: !274)
!450 = !DIFile(filename: "/usr/include/linux/types.h", directory: "")
!451 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_received", scope: !441, file: !442, line: 56, baseType: !195, size: 64, offset: 1664)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "segs_in", scope: !441, file: !442, line: 60, baseType: !250, size: 32, offset: 1728)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "data_segs_in", scope: !441, file: !442, line: 63, baseType: !250, size: 32, offset: 1760)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "rcv_nxt", scope: !441, file: !442, line: 66, baseType: !250, size: 32, offset: 1792)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "copied_seq", scope: !441, file: !442, line: 67, baseType: !250, size: 32, offset: 1824)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "rcv_wup", scope: !441, file: !442, line: 68, baseType: !250, size: 32, offset: 1856)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "snd_nxt", scope: !441, file: !442, line: 69, baseType: !250, size: 32, offset: 1888)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "segs_out", scope: !441, file: !442, line: 70, baseType: !250, size: 32, offset: 1920)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "data_segs_out", scope: !441, file: !442, line: 73, baseType: !250, size: 32, offset: 1952)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_acked", scope: !441, file: !442, line: 76, baseType: !195, size: 64, offset: 1984)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "snd_una", scope: !441, file: !442, line: 80, baseType: !250, size: 32, offset: 2048)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "snd_sml", scope: !441, file: !442, line: 81, baseType: !250, size: 32, offset: 2080)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "rcv_tstamp", scope: !441, file: !442, line: 82, baseType: !250, size: 32, offset: 2112)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "lsndtime", scope: !441, file: !442, line: 83, baseType: !250, size: 32, offset: 2144)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "last_oow_ack_time", scope: !441, file: !442, line: 84, baseType: !250, size: 32, offset: 2176)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "tsoffset", scope: !441, file: !442, line: 86, baseType: !250, size: 32, offset: 2208)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "snd_wl1", scope: !441, file: !442, line: 90, baseType: !250, size: 32, offset: 2240)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "snd_wnd", scope: !441, file: !442, line: 91, baseType: !250, size: 32, offset: 2272)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "max_window", scope: !441, file: !442, line: 92, baseType: !250, size: 32, offset: 2304)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "mss_cache", scope: !441, file: !442, line: 93, baseType: !250, size: 32, offset: 2336)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "window_clamp", scope: !441, file: !442, line: 95, baseType: !250, size: 32, offset: 2368)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "rcv_ssthresh", scope: !441, file: !442, line: 96, baseType: !250, size: 32, offset: 2400)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "rack", scope: !441, file: !442, line: 105, baseType: !474, size: 192, offset: 2432)
!474 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tcp_rack", file: !442, line: 99, size: 192, elements: !475)
!475 = !{!476, !477, !478, !479, !480}
!476 = !DIDerivedType(tag: DW_TAG_member, name: "mstamp", scope: !474, file: !442, line: 100, baseType: !335, size: 64)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "rtt_us", scope: !474, file: !442, line: 101, baseType: !250, size: 32, offset: 64)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "end_seq", scope: !474, file: !442, line: 102, baseType: !250, size: 32, offset: 96)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "advanced", scope: !474, file: !442, line: 103, baseType: !302, size: 8, offset: 128)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "reord", scope: !474, file: !442, line: 104, baseType: !302, size: 8, offset: 136)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "advmss", scope: !441, file: !442, line: 106, baseType: !446, size: 16, offset: 2624)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "chrono_start", scope: !441, file: !442, line: 107, baseType: !250, size: 32, offset: 2656)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "chrono_stat", scope: !441, file: !442, line: 108, baseType: !484, size: 96, offset: 2688)
!484 = !DICompositeType(tag: DW_TAG_array_type, baseType: !250, size: 96, elements: !485)
!485 = !{!486}
!486 = !DISubrange(count: 3)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "chrono_type", scope: !441, file: !442, line: 109, baseType: !302, size: 2, offset: 2784, flags: DIFlagBitField, extraData: i64 2784)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "rate_app_limited", scope: !441, file: !442, line: 110, baseType: !302, size: 1, offset: 2786, flags: DIFlagBitField, extraData: i64 2784)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "fastopen_connect", scope: !441, file: !442, line: 111, baseType: !302, size: 1, offset: 2787, flags: DIFlagBitField, extraData: i64 2784)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "unused", scope: !441, file: !442, line: 112, baseType: !302, size: 4, offset: 2788, flags: DIFlagBitField, extraData: i64 2784)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "nonagle", scope: !441, file: !442, line: 113, baseType: !302, size: 4, offset: 2792, flags: DIFlagBitField, extraData: i64 2784)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "thin_lto", scope: !441, file: !442, line: 114, baseType: !302, size: 1, offset: 2796, flags: DIFlagBitField, extraData: i64 2784)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "unused1", scope: !441, file: !442, line: 115, baseType: !302, size: 1, offset: 2797, flags: DIFlagBitField, extraData: i64 2784)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "repair", scope: !441, file: !442, line: 116, baseType: !302, size: 1, offset: 2798, flags: DIFlagBitField, extraData: i64 2784)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "frto", scope: !441, file: !442, line: 117, baseType: !302, size: 1, offset: 2799, flags: DIFlagBitField, extraData: i64 2784)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "repair_queue", scope: !441, file: !442, line: 118, baseType: !302, size: 8, offset: 2800)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "syn_data", scope: !441, file: !442, line: 119, baseType: !302, size: 1, offset: 2808, flags: DIFlagBitField, extraData: i64 2808)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "syn_fastopen", scope: !441, file: !442, line: 120, baseType: !302, size: 1, offset: 2809, flags: DIFlagBitField, extraData: i64 2808)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "syn_fastopen_exp", scope: !441, file: !442, line: 121, baseType: !302, size: 1, offset: 2810, flags: DIFlagBitField, extraData: i64 2808)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "syn_fastopen_ch", scope: !441, file: !442, line: 122, baseType: !302, size: 1, offset: 2811, flags: DIFlagBitField, extraData: i64 2808)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "syn_data_acked", scope: !441, file: !442, line: 123, baseType: !302, size: 1, offset: 2812, flags: DIFlagBitField, extraData: i64 2808)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "save_syn", scope: !441, file: !442, line: 124, baseType: !302, size: 1, offset: 2813, flags: DIFlagBitField, extraData: i64 2808)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "is_cwnd_limited", scope: !441, file: !442, line: 125, baseType: !302, size: 1, offset: 2814, flags: DIFlagBitField, extraData: i64 2808)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "tlp_high_seq", scope: !441, file: !442, line: 126, baseType: !250, size: 32, offset: 2816)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_mstamp", scope: !441, file: !442, line: 129, baseType: !335, size: 64, offset: 2880)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "srtt_us", scope: !441, file: !442, line: 130, baseType: !250, size: 32, offset: 2944)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "mdev_us", scope: !441, file: !442, line: 131, baseType: !250, size: 32, offset: 2976)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "mdev_max_us", scope: !441, file: !442, line: 132, baseType: !250, size: 32, offset: 3008)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "rttvar_us", scope: !441, file: !442, line: 133, baseType: !250, size: 32, offset: 3040)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "rtt_seq", scope: !441, file: !442, line: 134, baseType: !250, size: 32, offset: 3072)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "rtt_min", scope: !441, file: !442, line: 135, baseType: !512, offset: 3104)
!512 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "minmax", file: !513, line: 11, elements: !514)
!513 = !DIFile(filename: "../../stub_model/header/simple_minmax.h", directory: "/mnt/d/wsl/smack/examples/linux-4.12/test_main_files/reno")
!514 = !{}
!515 = !DIDerivedType(tag: DW_TAG_member, name: "packets_out", scope: !441, file: !442, line: 137, baseType: !250, size: 32, offset: 3104)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "retrans_out", scope: !441, file: !442, line: 138, baseType: !250, size: 32, offset: 3136)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "max_packets_out", scope: !441, file: !442, line: 139, baseType: !250, size: 32, offset: 3168)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "max_packets_seq", scope: !441, file: !442, line: 140, baseType: !250, size: 32, offset: 3200)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "urg_data", scope: !441, file: !442, line: 142, baseType: !446, size: 16, offset: 3232)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "ecn_flags", scope: !441, file: !442, line: 143, baseType: !302, size: 8, offset: 3248)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "keepalive_probes", scope: !441, file: !442, line: 144, baseType: !302, size: 8, offset: 3256)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "reordering", scope: !441, file: !442, line: 145, baseType: !250, size: 32, offset: 3264)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "snd_up", scope: !441, file: !442, line: 146, baseType: !250, size: 32, offset: 3296)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "rx_opt", scope: !441, file: !442, line: 151, baseType: !525, size: 256, offset: 3328)
!525 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tcp_options_received", file: !442, line: 21, size: 256, elements: !526)
!526 = !{!527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540}
!527 = !DIDerivedType(tag: DW_TAG_member, name: "ts_recent_stamp", scope: !525, file: !442, line: 23, baseType: !193, size: 64)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "ts_recent", scope: !525, file: !442, line: 24, baseType: !250, size: 32, offset: 64)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "rcv_tsval", scope: !525, file: !442, line: 25, baseType: !250, size: 32, offset: 96)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "rcv_tsecr", scope: !525, file: !442, line: 26, baseType: !250, size: 32, offset: 128)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "saw_tstamp", scope: !525, file: !442, line: 27, baseType: !446, size: 1, offset: 160, flags: DIFlagBitField, extraData: i64 160)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "tstamp_ok", scope: !525, file: !442, line: 28, baseType: !446, size: 1, offset: 161, flags: DIFlagBitField, extraData: i64 160)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "dsack", scope: !525, file: !442, line: 29, baseType: !446, size: 1, offset: 162, flags: DIFlagBitField, extraData: i64 160)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "wscale_ok", scope: !525, file: !442, line: 30, baseType: !446, size: 1, offset: 163, flags: DIFlagBitField, extraData: i64 160)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "sack_ok", scope: !525, file: !442, line: 31, baseType: !446, size: 4, offset: 164, flags: DIFlagBitField, extraData: i64 160)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "snd_wscale", scope: !525, file: !442, line: 32, baseType: !446, size: 4, offset: 168, flags: DIFlagBitField, extraData: i64 160)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "rcv_wscale", scope: !525, file: !442, line: 33, baseType: !446, size: 4, offset: 172, flags: DIFlagBitField, extraData: i64 160)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "num_sacks", scope: !525, file: !442, line: 34, baseType: !302, size: 8, offset: 176)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "user_mss", scope: !525, file: !442, line: 35, baseType: !446, size: 16, offset: 192)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "mss_clamp", scope: !525, file: !442, line: 36, baseType: !446, size: 16, offset: 208)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "snd_ssthresh", scope: !441, file: !442, line: 156, baseType: !250, size: 32, offset: 3584)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "snd_cwnd", scope: !441, file: !442, line: 157, baseType: !250, size: 32, offset: 3616)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "snd_cwnd_cnt", scope: !441, file: !442, line: 158, baseType: !250, size: 32, offset: 3648)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "snd_cwnd_clamp", scope: !441, file: !442, line: 159, baseType: !250, size: 32, offset: 3680)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "snd_cwnd_used", scope: !441, file: !442, line: 160, baseType: !250, size: 32, offset: 3712)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "snd_cwnd_stamp", scope: !441, file: !442, line: 161, baseType: !250, size: 32, offset: 3744)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "prior_cwnd", scope: !441, file: !442, line: 162, baseType: !250, size: 32, offset: 3776)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "prr_delivered", scope: !441, file: !442, line: 163, baseType: !250, size: 32, offset: 3808)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "prr_out", scope: !441, file: !442, line: 165, baseType: !250, size: 32, offset: 3840)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "delivered", scope: !441, file: !442, line: 166, baseType: !250, size: 32, offset: 3872)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "lost", scope: !441, file: !442, line: 167, baseType: !250, size: 32, offset: 3904)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "app_limited", scope: !441, file: !442, line: 168, baseType: !250, size: 32, offset: 3936)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "first_tx_mstamp", scope: !441, file: !442, line: 169, baseType: !335, size: 64, offset: 3968)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "delivered_mstamp", scope: !441, file: !442, line: 170, baseType: !335, size: 64, offset: 4032)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "rate_delivered", scope: !441, file: !442, line: 171, baseType: !250, size: 32, offset: 4096)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "rate_interval_us", scope: !441, file: !442, line: 172, baseType: !250, size: 32, offset: 4128)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "rcv_wnd", scope: !441, file: !442, line: 174, baseType: !250, size: 32, offset: 4160)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "write_seq", scope: !441, file: !442, line: 175, baseType: !250, size: 32, offset: 4192)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "notsent_lowat", scope: !441, file: !442, line: 176, baseType: !250, size: 32, offset: 4224)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "pushed_seq", scope: !441, file: !442, line: 177, baseType: !250, size: 32, offset: 4256)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "lost_out", scope: !441, file: !442, line: 178, baseType: !250, size: 32, offset: 4288)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "sacked_out", scope: !441, file: !442, line: 179, baseType: !250, size: 32, offset: 4320)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "fackets_out", scope: !441, file: !442, line: 180, baseType: !250, size: 32, offset: 4352)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "lost_skb_hint", scope: !441, file: !442, line: 183, baseType: !565, size: 64, offset: 4416)
!565 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !566, size: 64)
!566 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sk_buff", file: !336, line: 12, size: 640, elements: !567)
!567 = !{!568, !576, !577, !581}
!568 = !DIDerivedType(tag: DW_TAG_member, scope: !566, file: !336, line: 14, baseType: !569, size: 128)
!569 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !566, file: !336, line: 14, size: 128, elements: !570)
!570 = !{!571}
!571 = !DIDerivedType(tag: DW_TAG_member, scope: !569, file: !336, line: 15, baseType: !572, size: 128)
!572 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !569, file: !336, line: 15, size: 128, elements: !573)
!573 = !{!574, !575}
!574 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !572, file: !336, line: 17, baseType: !565, size: 64)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !572, file: !336, line: 18, baseType: !565, size: 64, offset: 64)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "sk", scope: !566, file: !336, line: 27, baseType: !288, size: 64, offset: 128)
!577 = !DIDerivedType(tag: DW_TAG_member, scope: !566, file: !336, line: 29, baseType: !578, size: 64, offset: 192)
!578 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !566, file: !336, line: 29, size: 64, elements: !579)
!579 = !{!580}
!580 = !DIDerivedType(tag: DW_TAG_member, name: "dev_scratch", scope: !578, file: !336, line: 35, baseType: !270, size: 64)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !566, file: !336, line: 43, baseType: !582, size: 384, align: 64, offset: 256)
!582 = !DICompositeType(tag: DW_TAG_array_type, baseType: !395, size: 384, elements: !583)
!583 = !{!584}
!584 = !DISubrange(count: 48)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "retransmit_skb_hint", scope: !441, file: !442, line: 184, baseType: !565, size: 64, offset: 4480)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "out_of_order_queue", scope: !441, file: !442, line: 187, baseType: !587, size: 64, offset: 4544)
!587 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_root", file: !588, line: 19, size: 64, elements: !589)
!588 = !DIFile(filename: "../../stub_model/header/simple_rbtree.h", directory: "/mnt/d/wsl/smack/examples/linux-4.12/test_main_files/reno")
!589 = !{!590}
!590 = !DIDerivedType(tag: DW_TAG_member, name: "rb_node", scope: !587, file: !588, line: 20, baseType: !591, size: 64)
!591 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !592, size: 64)
!592 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_node", file: !588, line: 12, size: 192, align: 64, elements: !593)
!593 = !{!594, !595, !596}
!594 = !DIDerivedType(tag: DW_TAG_member, name: "__rb_parent_color", scope: !592, file: !588, line: 13, baseType: !270, size: 64)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "rb_right", scope: !592, file: !588, line: 14, baseType: !591, size: 64, offset: 64)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "rb_left", scope: !592, file: !588, line: 15, baseType: !591, size: 64, offset: 128)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "ooo_last_skb", scope: !441, file: !442, line: 188, baseType: !565, size: 64, offset: 4608)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "duplicate_sack", scope: !441, file: !442, line: 191, baseType: !599, size: 64, offset: 4672)
!599 = !DICompositeType(tag: DW_TAG_array_type, baseType: !600, size: 64, elements: !604)
!600 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tcp_sack_block", file: !442, line: 16, size: 64, elements: !601)
!601 = !{!602, !603}
!602 = !DIDerivedType(tag: DW_TAG_member, name: "start_seq", scope: !600, file: !442, line: 17, baseType: !250, size: 32)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "end_seq", scope: !600, file: !442, line: 18, baseType: !250, size: 32, offset: 32)
!604 = !{!605}
!605 = !DISubrange(count: 1)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "selective_acks", scope: !441, file: !442, line: 192, baseType: !607, size: 256, offset: 4736)
!607 = !DICompositeType(tag: DW_TAG_array_type, baseType: !600, size: 256, elements: !608)
!608 = !{!609}
!609 = !DISubrange(count: 4)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "recv_sack_cache", scope: !441, file: !442, line: 194, baseType: !607, size: 256, offset: 4992)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "highest_sack", scope: !441, file: !442, line: 196, baseType: !565, size: 64, offset: 5248)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "lost_cnt_hint", scope: !441, file: !442, line: 202, baseType: !194, size: 32, offset: 5312)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "prior_ssthresh", scope: !441, file: !442, line: 204, baseType: !250, size: 32, offset: 5344)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "high_seq", scope: !441, file: !442, line: 205, baseType: !250, size: 32, offset: 5376)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "retrans_stamp", scope: !441, file: !442, line: 207, baseType: !250, size: 32, offset: 5408)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "undo_marker", scope: !441, file: !442, line: 210, baseType: !250, size: 32, offset: 5440)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "undo_retrans", scope: !441, file: !442, line: 211, baseType: !194, size: 32, offset: 5472)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "total_retrans", scope: !441, file: !442, line: 212, baseType: !250, size: 32, offset: 5504)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "urg_seq", scope: !441, file: !442, line: 214, baseType: !250, size: 32, offset: 5536)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "keepalive_time", scope: !441, file: !442, line: 215, baseType: !7, size: 32, offset: 5568)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "keepalive_intvl", scope: !441, file: !442, line: 216, baseType: !7, size: 32, offset: 5600)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "linger2", scope: !441, file: !442, line: 218, baseType: !194, size: 32, offset: 5632)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "rcv_rtt_est", scope: !441, file: !442, line: 225, baseType: !624, size: 128, offset: 5696)
!624 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !441, file: !442, line: 221, size: 128, elements: !625)
!625 = !{!626, !627, !628}
!626 = !DIDerivedType(tag: DW_TAG_member, name: "rtt_us", scope: !624, file: !442, line: 222, baseType: !250, size: 32)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !624, file: !442, line: 223, baseType: !250, size: 32, offset: 32)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !624, file: !442, line: 224, baseType: !335, size: 64, offset: 64)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "rcvq_space", scope: !441, file: !442, line: 232, baseType: !630, size: 128, offset: 5824)
!630 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !441, file: !442, line: 228, size: 128, elements: !631)
!631 = !{!632, !633, !634}
!632 = !DIDerivedType(tag: DW_TAG_member, name: "space", scope: !630, file: !442, line: 229, baseType: !194, size: 32)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !630, file: !442, line: 230, baseType: !250, size: 32, offset: 32)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !630, file: !442, line: 231, baseType: !335, size: 64, offset: 64)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "mtu_probe", scope: !441, file: !442, line: 238, baseType: !636, size: 64, offset: 5952)
!636 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !441, file: !442, line: 235, size: 64, elements: !637)
!637 = !{!638, !639}
!638 = !DIDerivedType(tag: DW_TAG_member, name: "probe_seq_start", scope: !636, file: !442, line: 236, baseType: !250, size: 32)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "probe_seq_end", scope: !636, file: !442, line: 237, baseType: !250, size: 32, offset: 32)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "mtu_info", scope: !441, file: !442, line: 239, baseType: !250, size: 32, offset: 6016)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "fastopen_req", scope: !441, file: !442, line: 245, baseType: !642, size: 64, offset: 6080)
!642 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !643, size: 64)
!643 = !DICompositeType(tag: DW_TAG_structure_type, name: "tcp_fastopen_request", file: !442, line: 245, flags: DIFlagFwdDecl)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "fastopen_rsk", scope: !441, file: !442, line: 249, baseType: !645, size: 64, offset: 6144)
!645 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !646, size: 64)
!646 = !DICompositeType(tag: DW_TAG_structure_type, name: "request_sock", file: !442, line: 249, flags: DIFlagFwdDecl)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "saved_syn", scope: !441, file: !442, line: 250, baseType: !648, size: 64, offset: 6208)
!648 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64)
!649 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 64)
!650 = !{!0, !651, !654, !657, !659, !661, !663, !665, !667, !669, !671, !673, !675, !677, !679, !681, !683, !685, !687, !691, !694, !696, !698, !700}
!651 = !DIGlobalVariableExpression(var: !652, expr: !DIExpression())
!652 = distinct !DIGlobalVariable(name: "tcp_reno", scope: !2, file: !653, line: 249, type: !280, isLocal: false, isDefinition: true)
!653 = !DIFile(filename: "../../stub_model/source/simple_tcp_cong.c", directory: "/mnt/d/wsl/smack/examples/linux-4.12/test_main_files/reno")
!654 = !DIGlobalVariableExpression(var: !655, expr: !DIExpression())
!655 = distinct !DIGlobalVariable(name: "sysctl_tcp_timestamps", scope: !2, file: !656, line: 11, type: !194, isLocal: false, isDefinition: true)
!656 = !DIFile(filename: "../../stub_model/source/simple_tcp_input.c", directory: "/mnt/d/wsl/smack/examples/linux-4.12/test_main_files/reno")
!657 = !DIGlobalVariableExpression(var: !658, expr: !DIExpression())
!658 = distinct !DIGlobalVariable(name: "sysctl_tcp_window_scaling", scope: !2, file: !656, line: 12, type: !194, isLocal: false, isDefinition: true)
!659 = !DIGlobalVariableExpression(var: !660, expr: !DIExpression())
!660 = distinct !DIGlobalVariable(name: "sysctl_tcp_sack", scope: !2, file: !656, line: 13, type: !194, isLocal: false, isDefinition: true)
!661 = !DIGlobalVariableExpression(var: !662, expr: !DIExpression())
!662 = distinct !DIGlobalVariable(name: "sysctl_tcp_max_reordering", scope: !2, file: !656, line: 15, type: !194, isLocal: false, isDefinition: true)
!663 = !DIGlobalVariableExpression(var: !664, expr: !DIExpression())
!664 = distinct !DIGlobalVariable(name: "sysctl_tcp_dsack", scope: !2, file: !656, line: 16, type: !194, isLocal: false, isDefinition: true)
!665 = !DIGlobalVariableExpression(var: !666, expr: !DIExpression())
!666 = distinct !DIGlobalVariable(name: "sysctl_tcp_app_win", scope: !2, file: !656, line: 17, type: !194, isLocal: false, isDefinition: true)
!667 = !DIGlobalVariableExpression(var: !668, expr: !DIExpression())
!668 = distinct !DIGlobalVariable(name: "sysctl_tcp_adv_win_scale", scope: !2, file: !656, line: 18, type: !194, isLocal: false, isDefinition: true)
!669 = !DIGlobalVariableExpression(var: !670, expr: !DIExpression())
!670 = distinct !DIGlobalVariable(name: "sysctl_tcp_challenge_ack_limit", scope: !2, file: !656, line: 22, type: !194, isLocal: false, isDefinition: true)
!671 = !DIGlobalVariableExpression(var: !672, expr: !DIExpression())
!672 = distinct !DIGlobalVariable(name: "sysctl_tcp_max_orphans", scope: !2, file: !656, line: 26, type: !194, isLocal: false, isDefinition: true)
!673 = !DIGlobalVariableExpression(var: !674, expr: !DIExpression())
!674 = distinct !DIGlobalVariable(name: "sysctl_tcp_frto", scope: !2, file: !656, line: 27, type: !194, isLocal: false, isDefinition: true)
!675 = !DIGlobalVariableExpression(var: !676, expr: !DIExpression())
!676 = distinct !DIGlobalVariable(name: "sysctl_tcp_min_rtt_wlen", scope: !2, file: !656, line: 28, type: !194, isLocal: false, isDefinition: true)
!677 = !DIGlobalVariableExpression(var: !678, expr: !DIExpression())
!678 = distinct !DIGlobalVariable(name: "sysctl_tcp_moderate_rcvbuf", scope: !2, file: !656, line: 29, type: !194, isLocal: false, isDefinition: true)
!679 = !DIGlobalVariableExpression(var: !680, expr: !DIExpression())
!680 = distinct !DIGlobalVariable(name: "sysctl_tcp_early_retrans", scope: !2, file: !656, line: 30, type: !194, isLocal: false, isDefinition: true)
!681 = !DIGlobalVariableExpression(var: !682, expr: !DIExpression())
!682 = distinct !DIGlobalVariable(name: "sysctl_tcp_invalid_ratelimit", scope: !2, file: !656, line: 31, type: !194, isLocal: false, isDefinition: true)
!683 = !DIGlobalVariableExpression(var: !684, expr: !DIExpression())
